ABIT-corp/phs-shield/STM32F4xx_HAL_Framework/Startup/stm32f4xx_Startup.c
	/* Copy the data segment initializers from FLASH to SRAM */
	pulSrc = &_sidata;
	pulDest = &_sdata;

	//for(pulDest = &_sdata; pulDest < &_edata;)
	while (pulDest < &_edata) {
		*(pulDest++) = *(pulSrc++);
	}

	/* Zero fill the bss segment. This is done with inline assembly since this
	 will clear the value of pulDest if it is not kept in a register. */
	__asm("ldr     r0, =_sbss");
	__asm("ldr     r1, =_ebss");
	__asm("mov     r2, #0");
	__asm(".thumb_func");
	__asm("zero_loop:");
	__asm("cmp     r0, r1");
	__asm("it      lt");
	__asm("strlt   r2, [r0], #4");
	__asm("blt     zero_loop");

	/* Relocate Vector Table */
#if(VECT_TAB_SRAM == 1)
	SCB->VTOR = SRAM_BASE | VECT_TAB_OFFSET;
#else
	SCB->VTOR = FLASH_BASE | VECT_TAB_OFFSET;
#endif

	/* Setup the microcontroller system(CMSIS) */
	SystemInit();

	/* Set to maximum Speed from PLL driven by HSI Oscillator */
#if(SET_SYS_MAX_SPEED == 1)
	RCC_PLLConfig(RCC_PLLSource_HSI, 8, 168, 2, 7);
	RCC_PLLCmd(ENABLE);
	while(RCC_GetFlagStatus(RCC_FLAG_PLLRDY) != SET);

	FLASH_SetLatency(FLASH_Latency_5);

	RCC_HCLKConfig(RCC_SYSCLK_Div1);
	RCC_PCLK1Config(RCC_HCLK_Div4);
	RCC_PCLK2Config(RCC_HCLK_Div2);

	RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);
#endif

	/* Call the application's entry point. */
	main();
}

/*----------Weak aliases------------------------------------------------------*/
/*
 * @brief	Any function with the same name will override this definition
 */
#pragma weak Reset_Handler = Default_Reset_Handler
#pragma weak NMI_Handler = Default_Handler1
#pragma weak HardFault_Handler = Default_Handler2
#pragma weak MemManage_Handler = Default_Handler3
#pragma weak BusFault_Handler = Default_Handler4
#pragma weak UsageFault_Handler = Default_Handler5
#pragma weak SVC_Handler = Default_Handler6
#pragma weak DebugMon_Handler = Default_Handler7
#pragma weak PendSV_Handler = Default_Handler8
#pragma weak SysTick_Handler = Default_Handler9
#pragma weak WWDG_IRQHandler = Default_Handler10
#pragma weak PVD_IRQHandler = Default_Handler11
#pragma weak TAMP_STAMP_IRQHandler = Default_Handler12
#pragma weak RTC_WKUP_IRQHandler = Default_Handler13
#pragma weak FLASH_IRQHandler = Default_Handler14
#pragma weak RCC_IRQHandler = Default_Handler15
#pragma weak EXTI0_IRQHandler = Default_Handler16
#pragma weak EXTI1_IRQHandler = Default_Handler17
#pragma weak EXTI2_IRQHandler = Default_Handler18
#pragma weak EXTI3_IRQHandler = Default_Handler19
#pragma weak EXTI4_IRQHandler = Default_Handler20
#pragma weak DMA1_Stream0_IRQHandler = Default_Handler21
#pragma weak DMA1_Stream1_IRQHandler = Default_Handler22
#pragma weak DMA1_Stream2_IRQHandler = Default_Handler23
#pragma weak DMA1_Stream3_IRQHandler = Default_Handler24
#pragma weak DMA1_Stream4_IRQHandler = Default_Handler25
#pragma weak DMA1_Stream5_IRQHandler = Default_Handler26
#pragma weak DMA1_Stream6_IRQHandler = Default_Handler27
#pragma weak ADC_IRQHandler = Default_Handler28
#pragma weak CAN1_TX_IRQHandler = Default_Handler29
#pragma weak CAN1_RX0_IRQHandler = Default_Handler30
#pragma weak CAN1_RX1_IRQHandler = Default_Handler31
#pragma weak CAN1_SCE_IRQHandler = Default_Handler32
#pragma weak EXTI9_5_IRQHandler = Default_Handler33
#pragma weak TIM1_BRK_TIM9_IRQHandler = Default_Handler34
#pragma weak TIM1_UP_TIM10_IRQHandler = Default_Handler35
#pragma weak TIM1_TRG_COM_TIM11_IRQHandler = Default_Handler36
#pragma weak TIM1_CC_IRQHandler = Default_Handler37
#pragma weak TIM2_IRQHandler = Default_Handler38
#pragma weak TIM3_IRQHandler = Default_Handler39
#pragma weak TIM4_IRQHandler = Default_Handler40
#pragma weak I2C1_EV_IRQHandler = Default_Handler41
#pragma weak I2C1_ER_IRQHandler = Default_Handler42
#pragma weak I2C2_EV_IRQHandler = Default_Handler43
#pragma weak I2C2_ER_IRQHandler = Default_Handler44
#pragma weak SPI1_IRQHandler = Default_Handler45
#pragma weak SPI2_IRQHandler = Default_Handler46
#pragma weak USART1_IRQHandler = Default_Handler47
#pragma weak USART2_IRQHandler = Default_Handler48
#pragma weak USART3_IRQHandler = Default_Handler49
#pragma weak EXTI15_10_IRQHandler = Default_Handler50
#pragma weak RTC_Alarm_IRQHandler = Default_Handler51
#pragma weak OTG_FS_WKUP_IRQHandler = Default_Handler52
#pragma weak TIM8_BRK_TIM12_IRQHandler = Default_Handler53
#pragma weak TIM8_UP_TIM13_IRQHandler = Default_Handler54
#pragma weak TIM8_TRG_COM_TIM14_IRQHandler = Default_Handler55
#pragma weak TIM8_CC_IRQHandler = Default_Handler56
#pragma weak DMA1_Stream7_IRQHandler = Default_Handler57
#pragma weak FSMC_IRQHandler = Default_Handler58
#pragma weak SDIO_IRQHandler = Default_Handler59
#pragma weak TIM5_IRQHandler = Default_Handler60
#pragma weak SPI3_IRQHandler = Default_Handler61
#pragma weak UART4_IRQHandler = Default_Handler62
#pragma weak UART5_IRQHandler = Default_Handler63
#pragma weak TIM6_DAC_IRQHandler = Default_Handler64
#pragma weak TIM7_IRQHandler = Default_Handler65
#pragma weak DMA2_Stream0_IRQHandler = Default_Handler66
#pragma weak DMA2_Stream1_IRQHandler = Default_Handler67
#pragma weak DMA2_Stream2_IRQHandler = Default_Handler68
#pragma weak DMA2_Stream3_IRQHandler = Default_Handler69
#pragma weak DMA2_Stream4_IRQHandler = Default_Handler70
#pragma weak ETH_IRQHandler = Default_Handler71
#pragma weak ETH_WKUP_IRQHandler = Default_Handler72
#pragma weak CAN2_TX_IRQHandler = Default_Handler73
#pragma weak CAN2_RX0_IRQHandler = Default_Handler74
#pragma weak CAN2_RX1_IRQHandler = Default_Handler75
#pragma weak CAN2_SCE_IRQHandler = Default_Handler76
#pragma weak OTG_FS_IRQHandler = Default_Handler77
#pragma weak DMA2_Stream5_IRQHandler = Default_Handler78
#pragma weak DMA2_Stream6_IRQHandler = Default_Handler79
#pragma weak DMA2_Stream7_IRQHandler = Default_Handler80
#pragma weak USART6_IRQHandler = Default_Handler81
#pragma weak I2C3_EV_IRQHandler = Default_Handler82
#pragma weak I2C3_ER_IRQHandler = Default_Handler83
#pragma weak OTG_HS_EP1_OUT_IRQHandler = Default_Handler84
#pragma weak OTG_HS_EP1_IN_IRQHandler = Default_Handler85
#pragma weak OTG_HS_WKUP_IRQHandler = Default_Handler86
#pragma weak OTG_HS_IRQHandler = Default_Handler87
#pragma weak DCMI_IRQHandler = Default_Handler88
#pragma weak CRYP_IRQHandler = Default_Handler89
#pragma weak HASH_RNG_IRQHandler = Default_Handler90
#pragma weak FPU_IRQHandler = Default_Handler91

