ABIT-corp/phs-shield/STM32F4xx_HAL_Framework/Startup/stm32f4xx_Startup.c
/*----------Default_Handler---------------------------------------------------*/
/*
 * @brief	This is the code that gets called when the
 * 			processor receives an unexpected interrupt
 */

void GetRegistersFromStack( uint32_t *StackAddress,  uint32_t vector)
{
	uint32_t r0, r1, r2, r3, r12, lr, pc, psr, vector_register;

	r0  = StackAddress[ 0 ];
	r1  = StackAddress[ 1 ];
	r2  = StackAddress[ 2 ];
	r3  = StackAddress[ 3 ];
	r12 = StackAddress[ 4 ];
	lr  = StackAddress[ 5 ];
	pc  = StackAddress[ 6 ];
	psr = StackAddress[ 7 ];

	rtc_backup_write(10,  r0);
	rtc_backup_write(11,  r1);
	rtc_backup_write(12,  r2);
	rtc_backup_write(13,  r3);
	rtc_backup_write(14, r12);
	rtc_backup_write(15,  lr);
	rtc_backup_write(16,  pc);
	rtc_backup_write(17, psr);
	rtc_backup_write(19, vector);

	vector_register = rtc_backup_read(18);
	vector_register++;
	rtc_backup_write(18, vector_register);
#if 0
	while(1);
#else
	NVIC_SystemReset();
#endif
}

#define FAULT_HANDLER(value)                                      \
__asm volatile (                                                  \
      "tst   lr, #4                                           \n" \
      "ite   eq                                               \n" \
      "mrseq r0, msp                                          \n" \
      "mrsne r0, psp                                          \n" \
      "mov   r1, "#value                                     "\n" \
      "bl    GetRegistersFromStack                            \n" \
)


 void Default_Handler1(void) {
	 FAULT_HANDLER(1);
 }
 void Default_Handler2(void) {
	 FAULT_HANDLER(2);
 }
 void Default_Handler3(void) {
	 FAULT_HANDLER(3);
 }
 void Default_Handler4(void) {
	 FAULT_HANDLER(4);
 }
 void Default_Handler5(void) {
	 FAULT_HANDLER(5);
 }
 void Default_Handler6(void) {
	 FAULT_HANDLER(6);
 }
 void Default_Handler7(void) {
	 FAULT_HANDLER(7);
 }
 void Default_Handler8(void) {
	 FAULT_HANDLER(8);
 }
 void Default_Handler9(void) {
	 FAULT_HANDLER(9);
 }
 void Default_Handler10(void) {
	 FAULT_HANDLER(10);
 }
 void Default_Handler11(void) {
	 FAULT_HANDLER(11);
 }
 void Default_Handler12(void) {
	 FAULT_HANDLER(12);
 }
 void Default_Handler13(void) {
	 FAULT_HANDLER(13);
 }
 void Default_Handler14(void) {
	 FAULT_HANDLER(14);
 }
 void Default_Handler15(void) {
	 FAULT_HANDLER(15);
 }
 void Default_Handler16(void) {
	 FAULT_HANDLER(16);
 }
 void Default_Handler17(void) {
	 FAULT_HANDLER(17);
 }
 void Default_Handler18(void) {
	 FAULT_HANDLER(18);
 }
 void Default_Handler19(void) {
	 FAULT_HANDLER(19);
 }
 void Default_Handler20(void) {
	 FAULT_HANDLER(20);
 }
 void Default_Handler21(void) {
	 FAULT_HANDLER(21);
 }
 void Default_Handler22(void) {
	 FAULT_HANDLER(22);
 }
 void Default_Handler23(void) {
	 FAULT_HANDLER(23);
 }
 void Default_Handler24(void) {
	 FAULT_HANDLER(24);
 }
 void Default_Handler25(void) {
	 FAULT_HANDLER(25);
 }
 void Default_Handler26(void) {
	 FAULT_HANDLER(26);
 }
 void Default_Handler27(void) {
	 FAULT_HANDLER(27);
 }
 void Default_Handler28(void) {
	 FAULT_HANDLER(28);
 }
 void Default_Handler29(void) {
	 FAULT_HANDLER(29);
 }
 void Default_Handler30(void) {
	 FAULT_HANDLER(30);
 }
 void Default_Handler31(void) {
	 FAULT_HANDLER(31);
 }
 void Default_Handler32(void) {
	 FAULT_HANDLER(32);
 }
 void Default_Handler33(void) {
	 FAULT_HANDLER(33);
 }
 void Default_Handler34(void) {
	 FAULT_HANDLER(34);
 }
 void Default_Handler35(void) {
	 FAULT_HANDLER(35);
 }
 void Default_Handler36(void) {
	 FAULT_HANDLER(36);
 }
 void Default_Handler37(void) {
	 FAULT_HANDLER(37);
 }
 void Default_Handler38(void) {
	 FAULT_HANDLER(38);
 }
 void Default_Handler39(void) {
	 FAULT_HANDLER(39);
 }
 void Default_Handler40(void) {
	 FAULT_HANDLER(40);
 }
 void Default_Handler41(void) {
	 FAULT_HANDLER(41);
 }
 void Default_Handler42(void) {
	 FAULT_HANDLER(42);
 }
 void Default_Handler43(void) {
	 FAULT_HANDLER(43);
 }
 void Default_Handler44(void) {
	 FAULT_HANDLER(44);
 }
 void Default_Handler45(void) {
	 FAULT_HANDLER(45);
 }
 void Default_Handler46(void) {
	 FAULT_HANDLER(46);
 }
 void Default_Handler47(void) {
	 FAULT_HANDLER(47);
 }
 void Default_Handler48(void) {
	 FAULT_HANDLER(48);
 }
 void Default_Handler49(void) {
	 FAULT_HANDLER(49);
 }
 void Default_Handler50(void) {
	 FAULT_HANDLER(50);
 }
 void Default_Handler51(void) {
	 FAULT_HANDLER(51);
 }
 void Default_Handler52(void) {
	 FAULT_HANDLER(52);
 }
 void Default_Handler53(void) {
	 FAULT_HANDLER(53);
 }
 void Default_Handler54(void) {
	 FAULT_HANDLER(54);
 }
 void Default_Handler55(void) {
	 FAULT_HANDLER(55);
 }
 void Default_Handler56(void) {
	 FAULT_HANDLER(56);
 }
 void Default_Handler57(void) {
	 FAULT_HANDLER(57);
 }
 void Default_Handler58(void) {
	 FAULT_HANDLER(58);
 }
 void Default_Handler59(void) {
	 FAULT_HANDLER(59);
 }
 void Default_Handler60(void) {
	 FAULT_HANDLER(60);
 }
 void Default_Handler61(void) {
	 FAULT_HANDLER(61);
 }
 void Default_Handler62(void) {
	 FAULT_HANDLER(62);
 }
 void Default_Handler63(void) {
	 FAULT_HANDLER(63);
 }
 void Default_Handler64(void) {
	 FAULT_HANDLER(64);
 }
 void Default_Handler65(void) {
	 FAULT_HANDLER(65);
 }
 void Default_Handler66(void) {
	 FAULT_HANDLER(66);
 }
 void Default_Handler67(void) {
	 FAULT_HANDLER(67);
 }
 void Default_Handler68(void) {
	 FAULT_HANDLER(68);
 }
 void Default_Handler69(void) {
	 FAULT_HANDLER(69);
 }
 void Default_Handler70(void) {
	 FAULT_HANDLER(70);
 }
 void Default_Handler71(void) {
	 FAULT_HANDLER(71);
 }
 void Default_Handler72(void) {
	 FAULT_HANDLER(72);
 }
 void Default_Handler73(void) {
	 FAULT_HANDLER(73);
 }
 void Default_Handler74(void) {
	 FAULT_HANDLER(74);
 }
 void Default_Handler75(void) {
	 FAULT_HANDLER(75);
 }
 void Default_Handler76(void) {
	 FAULT_HANDLER(76);
 }
 void Default_Handler77(void) {
	 FAULT_HANDLER(77);
 }
 void Default_Handler78(void) {
	 FAULT_HANDLER(78);
 }
 void Default_Handler79(void) {
	 FAULT_HANDLER(79);
 }
 void Default_Handler80(void) {
	 FAULT_HANDLER(80);
 }
 void Default_Handler81(void) {
	 FAULT_HANDLER(81);
 }
 void Default_Handler82(void) {
	 FAULT_HANDLER(82);
 }
 void Default_Handler83(void) {
	 FAULT_HANDLER(83);
 }
 void Default_Handler84(void) {
	 FAULT_HANDLER(84);
 }
 void Default_Handler85(void) {
	 FAULT_HANDLER(85);
 }
 void Default_Handler86(void) {
	 FAULT_HANDLER(86);
 }
 void Default_Handler87(void) {
	 FAULT_HANDLER(87);
 }
 void Default_Handler88(void) {
	 FAULT_HANDLER(88);
 }
 void Default_Handler89(void) {
	 FAULT_HANDLER(89);
 }
 void Default_Handler90(void) {
	 FAULT_HANDLER(90);
 }
 void Default_Handler91(void) {
	 FAULT_HANDLER(91);
 }
 void Default_Handler92(void) {
	 FAULT_HANDLER(92);
 }
 void Default_Handler93(void) {
	 FAULT_HANDLER(93);
 }
 void Default_Handler94(void) {
	 FAULT_HANDLER(94);
 }
 void Default_Handler95(void) {
	 FAULT_HANDLER(95);
 }
 void Default_Handler96(void) {
	 FAULT_HANDLER(96);
 }
 void Default_Handler97(void) {
	 FAULT_HANDLER(97);
 }
 void Default_Handler98(void) {
	 FAULT_HANDLER(98);
 }
 void Default_Handler99(void) {
	 FAULT_HANDLER(99);
 }
 void Default_Handler100(void) {
	 FAULT_HANDLER(100);
 }
